DataProcessors/АК_ПрикреплениеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АК_ПрикреплениеФайлов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВладелецСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресВоВременномХранилище</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/АК_ПрикреплениеФайлов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоставПриАктивизацииСтроки(Элемент)
	
	//
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//
	ИмяФайла = ТекущиеДанные.ПолноеИмяФайла;
	Файл = Новый Файл(ИмяФайла);
	
	//
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Файл.Расширение);
	
	//
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ТекущиеДанные.АдресВоВременномХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	
	//
	HTMLПредпросмотр = "<HTML><HEAD>
					|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
					|<META name=GENERATOR content=""MSHTML 8.00.7601.18870""></HEAD>
					|<BODY>";
					
					
	//
	стрИзображение = "<DIV><IMG style=""width:99%;"" src=""#REF""></DIV>"; 
	
	//
	Файл = Новый Файл(ИмяВременногоФайла);
	Если НЕ Файл.ЭтоКаталог() Тогда
		
		//
		Если Файл.Расширение = ".pdf" Тогда
			
			//
			стрИзображение = "<DIV><EMBED style=""width:99%;height:100%;"" src=""#REF""></DIV>";
			
		Иначе
			
			//
			стрИзображение = "<DIV><IMG style=""width:99%;"" src=""#REF""></DIV>";
			
		КонецЕсли;							
		
		//
		HTMLПредпросмотр = HTMLПредпросмотр + СтрЗаменить(стрИзображение, "#REF", ИмяВременногоФайла);
		
	Иначе
		
		//
		HTMLПредпросмотр = HTMLПредпросмотр + СтрЗаменить(стрИзображение, "#REF", "");
		
	КонецЕсли;						
	
	//
	HTMLПредпросмотр = HTMLПредпросмотр + "</BODY></HTML>";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//
	КаталогХраненияФайлов = Константы.КаталогХраненияФайлов.Получить(); 
	
	//
	КаталогВременныхФайлов = КаталогХраненияФайлов + "\" + "SC_" + ПараметрыСеанса.ТекущийПользователь.ИдентификаторПользователяИБ;
	СоздатьКаталог(КаталогВременныхФайлов);
	
	//
	ТЗ_СписокФайлов = Неопределено;
	
	//
	Параметры.Свойство("ВладелецСсылка", Объект.ВладелецСсылка);
	Если Параметры.Свойство("ТЗ_СписокФайлов", ТЗ_СписокФайлов) Тогда
	
		//ЭТО ФАЙЛЫ ИЗВНЕ
		Для Каждого СтрокаТЗ Из ТЗ_СписокФайлов Цикл
			
			//
			НоваяСтрока = Объект.Состав.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
		КонецЦикла; 	
	
	КонецЕсли; 
	
	//
	Если ЗначениеЗаполнено(Объект.ВладелецСсылка) Тогда
		
		//
		УИД = Строка(Объект.ВладелецСсылка.УникальныйИдентификатор());
		
		//
		КаталогМесяц = Формат(Объект.ВладелецСсылка.Дата, "ДФ=yyyyMM");
	
		//
		КаталогХраненияФайлов = КаталогХраненияФайлов + "\" + Объект.ВладелецСсылка.Метаданные().ПолноеИмя() + "\" + КаталогМесяц;
		
		//
		НайденныеФайлы = НайтиФайлы(КаталогХраненияФайлов, УИД + ".*", Истина);
		Для каждого НайденныйФайл Из НайденныеФайлы Цикл
			
			//
			Если НайденныйФайл.Расширение = ".zip" Тогда
				
				//
				КаталогВременныхФайлов = КаталогХраненияФайлов + "\" + "temp" + УИД;
				СоздатьКаталог(КаталогВременныхФайлов);
				
				//
				ЧтениеZIPФайла = Новый ЧтениеZipФайла(НайденныйФайл.ПолноеИмя);
				Для каждого ЭлементАрхива Из ЧтениеZIPФайла.Элементы Цикл
					
					//
					ИмяВременногоФайла = КаталогВременныхФайлов + "\" + ЭлементАрхива.Имя;
					ЧтениеZIPФайла.Извлечь(ЭлементАрхива, КаталогВременныхФайлов, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
					
					//
					НоваяСтрока = Объект.Состав.Добавить();
					НоваяСтрока.ИмяФайла = ЭлементАрхива.Имя;
					НоваяСтрока.ПолноеИмяФайла = ИмяВременногоФайла;
					НоваяСтрока.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(НоваяСтрока.ПолноеИмяФайла), УникальныйИдентификатор);
				
				КонецЦикла; 
				
				//
				УдалитьФайлы(КаталогВременныхФайлов);
				
			Иначе
				
				//
				НоваяСтрока = Объект.Состав.Добавить();
				НоваяСтрока.ИмяФайла = НайденныйФайл.Имя;
				НоваяСтрока.ПолноеИмяФайла = НайденныйФайл.ПолноеИмя;
				НоваяСтрока.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(НоваяСтрока.ПолноеИмяФайла));
				
			КонецЕсли; 
		
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДобавитьФайл(Команда)
	
	//
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Истина;
	ДиалогВыбораФайла.ПредварительныйПросмотр = Истина;
	
	//
	Если ДиалогВыбораФайла.Выбрать() Тогда
	
		//
		Для каждого ВыбранныйФайл Из ДиалогВыбораФайла.ВыбранныеФайлы Цикл
			
			//
			Файл = Новый Файл(ВыбранныйФайл);
			
			//
			НоваяСтрока = Объект.Состав.Добавить();
			НоваяСтрока.ИмяФайла = Файл.Имя;
			НоваяСтрока.ПолноеИмяФайла = Файл.ПолноеИмя;
			
			//
			НоваяСтрока.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(НоваяСтрока.ПолноеИмяФайла));
		
		КонецЦикла; 
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	//
	Если ЗначениеЗаполнено(Объект.ВладелецСсылка) Тогда
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		 
		Обработки.АК_ПрикреплениеФайлов.ПереместитьФайлыВКаталогХранения(Объект.ВладелецСсылка, Объект.Состав);
		 
		#КонецЕсли 
		
		//
		Закрыть(Неопределено);
	
	Иначе
		
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		
		//
		Закрыть(Объект.Состав.Выгрузить());
		
		#Иначе
			
		//
		Закрыть(Неопределено);
		
		#КонецЕсли 
	
	КонецЕсли; 
	
КонецПроцедуры
